hqs17017301634-max/ESP-IDF_waveshare_ESP32_S3_RS485_CAN/include/web/mcp2515_dashboard.h
// WiFi AP (hotspot) — overridable at runtime
static char apSSID[33] = "";
static char apPass[65] = "";
static bool apHidden = false; // when true, SSID is not broadcast (hidden AP)
static constexpr size_t kDashMaxSsidLen = 32;
static constexpr size_t kDashMinApPassLen = 8;
static constexpr size_t kDashMaxPassLen = 64;
static constexpr int kDashApChannel = 1;
static constexpr int kDashApMaxConn = 4;
static uint8_t apRuntimeChannel = kDashApChannel;
static unsigned long apLastChannelSyncMs = 0;
static uint8_t apLastChannelSyncTarget = 0;
static bool apLastChannelSyncOk = false;

// WiFi STA (client) mode for internet access
static char staSSID[33] = "";
static char staPass[65] = "";
static bool staConnected = false;
static bool staConnectAttemptActive = false;
static bool staStaticIP = false;

// Multi-SSID storage
static constexpr uint8_t kDashMaxWifiNetworks = 4;
struct DashWifiNetwork
{
    char ssid[33];
    char pass[65];
    bool useStatic;
    char ip[16];
    char gw[16];
    char mask[16];
    char dns[16];
};
static DashWifiNetwork wifiNetworks[kDashMaxWifiNetworks] = {};
static uint8_t wifiNetworkCount = 0;
static int8_t wifiActiveSlot = -1;    // slot currently selected for STA attempt
static int8_t wifiNextRotateSlot = 0; // next slot to try when rotating
static bool updateBetaChannel = false;
static bool autoUpdateEnabled = false;
static bool autoUpdateDone = false;            // one-shot per boot
static unsigned long autoUpdateEligibleAt = 0; // millis() at which auto-check may fire
static unsigned long staConnectStartedAt = 0;
static unsigned long staRetryAt = 0;
static uint8_t staConsecutiveFailures = 0; // diagnostics only; retry interval is fixed
static constexpr unsigned long kDashStaBootDelayMs = 1000;
static constexpr unsigned long kDashStaSavedPollMs = 5000;
static constexpr unsigned long kDashStaConnectTimeoutMs = 10000;
// kDashStaRetryMs kept for backward compat with older references.
static constexpr unsigned long kDashStaRetryMs = kDashStaSavedPollMs;
static IPAddress staIP(0, 0, 0, 0);
static IPAddress staGW(0, 0, 0, 0);
static IPAddress staMask(255, 255, 255, 0);
static IPAddress staDNS(0, 0, 0, 0);

// Multi-SSID NVS helpers (key form: w0s, w0p, w0t, w0i, w0g, w0m, w0d)
static String dashWifiKey(uint8_t slot, const char *sub)
{
    String k = "w";
    k += slot;
    k += sub;
    return k;
}
static void dashClearWifiNetwork(DashWifiNetwork &n)
{
    n.ssid[0] = 0;
    n.pass[0] = 0;
    n.useStatic = false;
    n.ip[0] = 0;
    n.gw[0] = 0;
    n.mask[0] = 0;
    n.dns[0] = 0;
}
static void dashRotateAndConnect();
#if !defined(PRODUCT_WIFI_MAX)
static void dashSwapHandler(uint8_t mode);
static void dashApplyFilters();
#endif
static void dashApplyRuntimeState();
static void dashClearLegacyOptionPrefs();
static void dashLog(const String &s);

#if !defined(PRODUCT_WIFI_MAX)
// CAN recorder
#ifndef REC_CAP
#define REC_CAP 8000
#endif
static constexpr unsigned long kRecMaxDurationMs = 60000UL;
struct RecFrame
{
    unsigned long ts;
    char dir;
    uint32_t id;
    uint8_t dlc;
    uint8_t data[8];
};
static RecFrame *recBuf = nullptr;
static bool recBufInPsram = false;
static volatile bool recActive = false;
static volatile int recCount = 0;
static bool recSaved = false;
static unsigned long recStartMs = 0;
#endif

#if !defined(PRODUCT_WIFI_MAX)
// CAN sniffer ring buffer
#define SNIFFER_CAP 30
struct SniffFrame
{
    unsigned long ts;
    uint32_t id;
    uint8_t dlc;
    uint8_t data[8];
};
static SniffFrame sniffBuf[SNIFFER_CAP];
static int sniffHead = 0;
static int sniffCount = 0;
#endif

enum DashWriteProbeState : uint8_t
{
    kDashWriteProbeIdle = 0,
    kDashWriteProbePending = 1,
    kDashWriteProbeMatch = 2,
    kDashWriteProbeDifferent = 3,
    kDashWriteProbeFailed = 4,
};

struct DashWriteProbe
{
    bool active = false;
    bool hasRx = false;
    uint8_t state = kDashWriteProbeIdle;
    uint32_t id = 0;
    int8_t mux = -1;
    uint8_t txDlc = 0;
    uint8_t rxDlc = 0;
    uint8_t txData[8] = {};
    uint8_t rxData[8] = {};
    unsigned long txMs = 0;
    unsigned long rxMs = 0;
};
static DashWriteProbe dashWriteProbe;

#if !defined(PRODUCT_WIFI_MAX)
struct DashApRestoreState
{
    bool gearSeen = false;
    uint8_t gearRaw = 0xFF;
    bool brakeSeen = false;
    uint8_t brakePedalRaw = 0xFF;
    bool chassisSeen = false;
    bool brakeTorqueActive = false;
    uint8_t anyVdcActive = 0xFF;
    bool tcActive = false;
    uint8_t vdcControlActive = 0xFF;
    bool steerSeen = false;
    uint8_t steerValidity = 0xFF;
    int16_t steerAngleX10 = 0;
    int16_t steerSpeedX10 = 0;
    unsigned long steerMs = 0;
    bool dasSettingsSeen = false;
    uint8_t dasSettingsData[8] = {};
    unsigned long dasSettingsMs = 0;
    uint8_t dasSettingsCounter = 0xFF;
    bool dasAccSeen = false;
    uint8_t dasAccState = 0xFF;
    unsigned long dasAccDropMs = 0;
    unsigned long lastDropHandledMs = 0;
    unsigned long lastTxMs = 0;
};
static DashApRestoreState apRestoreState;
static constexpr unsigned long kDashApRestoreTxCooldownMs = 1000;
#endif

#if !defined(PRODUCT_WIFI_MAX)
static int8_t dashFrameMux(const CanFrame &frame)
{
    if ((frame.id == 1006 || frame.id == 1021) && frame.dlc > 0)
        return static_cast<int8_t>(readMuxID(frame));
    return -1;
}

static uint32_t dashReadBitsLE(const CanFrame &frame, uint8_t startBit, uint8_t bitCount)
{
    uint32_t value = 0;
    for (uint8_t i = 0; i < bitCount; i++)
    {
        uint8_t bit = startBit + i;
        if (bit >= frame.dlc * 8)
            break;
        if (frame.data[bit / 8] & (1U << (bit % 8)))
            value |= 1UL << i;
    }
    return value;
}

static bool dashReadBit(const CanFrame &frame, uint8_t bit)
{
    return dashReadBitsLE(frame, bit, 1) != 0;
}

static uint8_t dashCounterChecksumByte(const CanFrame &frame, uint8_t checksumByteIndex = 7)
{
    if (checksumByteIndex >= frame.dlc)
        return 0;
    uint16_t sum = static_cast<uint16_t>(frame.id & 0xFF) +
                   static_cast<uint16_t>((frame.id >> 8) & 0xFF);
    for (uint8_t i = 0; i < frame.dlc; i++)
    {
        if (i == checksumByteIndex)
            sum += frame.data[i] & 0x0F;
        else
            sum += frame.data[i];
    }
    uint8_t checksum = static_cast<uint8_t>((0x10 - (sum & 0x0F)) & 0x0F);
    return static_cast<uint8_t>((checksum << 4) | (frame.data[checksumByteIndex] & 0x0F));
}

static void dashResetWriteProbe()
{
    dashWriteProbe = {};
    dashWriteProbe.mux = -1;
    dashWriteProbe.state = kDashWriteProbeIdle;
}

static bool dashEnsureRecBuffer()
{
    if (recBuf)
        return true;
#if defined(CONFIG_SPIRAM) && CONFIG_SPIRAM
    recBuf = static_cast<RecFrame *>(heap_caps_calloc(REC_CAP, sizeof(RecFrame), MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT));
    if (recBuf)
    {
        recBufInPsram = true;
        Serial.println("[REC] Buffer allocated in PSRAM");
        return true;
    }
#endif
    recBuf = static_cast<RecFrame *>(heap_caps_calloc(REC_CAP, sizeof(RecFrame), MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT));
    recBufInPsram = false;
    if (!recBuf)
    {
        Serial.println("[REC] Buffer allocation failed");
        return false;
    }
    Serial.println("[REC] Buffer allocated in internal RAM");
    return true;
}

static bool dashSaveRecordingToSpiffs(int n)
{
    if (!recBuf)
    {
        dashLog("[REC] Save failed: buffer unavailable");
        return false;
    }
    if (n < 0)
        n = 0;
    if (n > REC_CAP)
        n = REC_CAP;

    File f = SPIFFS.open("/rec.csv", "w");
    if (!f)
    {
        dashLog("[REC] SPIFFS write failed");
        return false;
    }

    f.println("ts_ms,dir,id,dlc,b0,b1,b2,b3,b4,b5,b6,b7");
    char line[96];
    for (int i = 0; i < n; i++)
    {
        int len = snprintf(line, sizeof(line),
                           "%lu,%c,%lu,%u,%u,%u,%u,%u,%u,%u,%u,%u\n",
                           recBuf[i].ts,
                           recBuf[i].dir ? recBuf[i].dir : 'R',
                           static_cast<unsigned long>(recBuf[i].id),
                           static_cast<unsigned>(recBuf[i].dlc),
                           static_cast<unsigned>(recBuf[i].data[0]),
                           static_cast<unsigned>(recBuf[i].data[1]),
                           static_cast<unsigned>(recBuf[i].data[2]),
                           static_cast<unsigned>(recBuf[i].data[3]),
                           static_cast<unsigned>(recBuf[i].data[4]),
                           static_cast<unsigned>(recBuf[i].data[5]),
                           static_cast<unsigned>(recBuf[i].data[6]),
                           static_cast<unsigned>(recBuf[i].data[7]));
        if (len > 0)
            f.write(reinterpret_cast<const uint8_t *>(line),
                    static_cast<size_t>(len < static_cast<int>(sizeof(line)) ? len : sizeof(line) - 1));
    }
    f.close();
    recSaved = true;
    dashLog("[REC] Saved " + String(n) + " frames to SPIFFS");
    return true;
}

