hqs17017301634-max/ESP-IDF_waveshare_ESP32_S3_RS485_CAN/include/web/mcp2515_dashboard.h
static bool dashStopRecordingAndSave(const char *reason = nullptr)
{
    if (!recActive && recSaved)
        return true;
    recActive = false;
    int n = recCount;
    bool ok = dashSaveRecordingToSpiffs(n);
    if (reason && *reason)
        dashLog(String("[REC] Stopped: ") + reason);
    return ok;
}

static void dashRecordCanFrame(const CanFrame &f, char dir)
{
    if (!recActive || !recBuf)
        return;
    int idx = recCount;
    if (idx >= REC_CAP)
        return;
    uint8_t dlc = (f.dlc <= 8) ? f.dlc : 8;
    recBuf[idx].ts = millis();
    recBuf[idx].dir = dir;
    recBuf[idx].id = f.id;
    recBuf[idx].dlc = dlc;
    memset(recBuf[idx].data, 0, sizeof(recBuf[idx].data));
    memcpy(recBuf[idx].data, f.data, dlc);
    recCount = idx + 1;
    if (recCount >= REC_CAP)
        dashStopRecordingAndSave("frame limit");
}

static void dashRecordApRestoreFrame(const CanFrame &frame, unsigned long now)
{
    if (frame.id == 280 && frame.dlc >= 3)
    {
        apRestoreState.gearSeen = true;
        apRestoreState.gearRaw = readDIGear(frame);
        apRestoreState.brakeSeen = true;
        apRestoreState.brakePedalRaw = static_cast<uint8_t>(dashReadBitsLE(frame, 19, 2));
        return;
    }
    if (frame.id == 0x148 && frame.dlc >= 8)
    {
        apRestoreState.chassisSeen = true;
        apRestoreState.brakeTorqueActive = dashReadBit(frame, 15);
        apRestoreState.anyVdcActive = static_cast<uint8_t>(dashReadBitsLE(frame, 34, 2));
        apRestoreState.tcActive = dashReadBit(frame, 42);
        apRestoreState.vdcControlActive = static_cast<uint8_t>(dashReadBitsLE(frame, 60, 3));
        return;
    }
    if (frame.id == 0x129 && frame.dlc >= 6)
    {
        uint16_t angleRaw = static_cast<uint16_t>(dashReadBitsLE(frame, 16, 14));
        uint16_t speedRaw = static_cast<uint16_t>(dashReadBitsLE(frame, 32, 14));
        apRestoreState.steerSeen = true;
        apRestoreState.steerValidity = static_cast<uint8_t>(dashReadBitsLE(frame, 30, 2));
        apRestoreState.steerAngleX10 = angleRaw == 0x3FFF ? 0 : static_cast<int16_t>(angleRaw) - 8192;
        apRestoreState.steerSpeedX10 = static_cast<int16_t>(static_cast<int32_t>(speedRaw) * 5 - 40960);
        apRestoreState.steerMs = now;
        return;
    }
    if (frame.id == 0x293 && frame.dlc >= 8)
    {
        apRestoreState.dasSettingsSeen = true;
        apRestoreState.dasSettingsMs = now;
        memcpy(apRestoreState.dasSettingsData, frame.data, 8);
        apRestoreState.dasSettingsCounter = frame.data[7] & 0x0F;
        return;
    }
    if (frame.id == 0x389 && frame.dlc >= 4)
    {
        uint8_t accState = static_cast<uint8_t>((frame.data[3] >> 2) & 0x1F);
        if (apRestoreState.dasAccSeen && apRestoreState.dasAccState > 0 && accState == 0)
            apRestoreState.dasAccDropMs = now;
        apRestoreState.dasAccSeen = true;
        apRestoreState.dasAccState = accState;
    }
}

static bool dashWriteProbeMatches(const CanFrame &frame)
{
    if (!dashWriteProbe.active || dashWriteProbe.id != frame.id)
        return false;

    int8_t mux = dashFrameMux(frame);
    if (dashWriteProbe.mux < 0)
        return mux < 0;
    return mux == dashWriteProbe.mux;
}

static const char *decodeCanId(uint32_t id)
{
    switch (id)
    {
    case 0x045:
        return "STW_ACTN_RQ";
    case 0x129:
        return "Steering angle";
    case 0x175:
        return "Speed";
    case 0x186:
        return "Gear/Drive state";
    case 0x118:
        return "DI_systemStatus";
    case 0x233:
        return "UI_stalklessControl";
    case 0x257:
        return "State of charge";
    case 0x293:
        return "DAS control";
    case 0x321:
        return "Autopilot state";
    case 0x329:
        return "UI_autopilot";
    case 0x399:
        return "DAS_status";
    case 0x3E8:
        return "UI_driverAssistControl";
    case 0x3FD:
        return "UI_autopilotControl";
    case 0x678:
        return "GTW_gearControl";
    default:
        return "";
    }
}

static void sniffPush(const CanFrame &f)
{
    uint8_t dlc = (f.dlc <= 8) ? f.dlc : 8;
    sniffBuf[sniffHead] = {millis(), f.id, dlc, {}};
    memcpy(sniffBuf[sniffHead].data, f.data, dlc);
    sniffHead = (sniffHead + 1) % SNIFFER_CAP;
    if (sniffCount < SNIFFER_CAP)
        sniffCount++;
}
#endif

#define LOG_CAP 80
struct LogEntry
{
    String msg;
    unsigned long seq;
};
static LogEntry logBuf[LOG_CAP];
static int logHead = 0;
static int logCount = 0;
static unsigned long logSeq = 0;
// Cursor tracking how much of logRing we have copied into logBuf so far.
// logRing is filled by HW3/HW4 handlers when enablePrint is on (per-frame
// "AD: 1, Profile: 2, Offset: ..." diagnostics). We drain it here on demand
// so the WebUI /log endpoint surfaces those diagnostics in real time.
static uint32_t logRingDrainCursor = 0;

static void dashLog(const String &s)
{
    logBuf[logHead] = {String(millis() / 1000) + "s " + s, ++logSeq};
    logHead = (logHead + 1) % LOG_CAP;
    if (logCount < LOG_CAP)
        logCount++;
    Serial.println(s);
}

// Pull all new entries from the per-frame handler logRing (in handlers.h)
// into logBuf so /log returns them. Cheap: bounded by ring capacity (32).
static void dashDrainLogRing()
{
    uint32_t h = logRing.currentHead();
    if (h <= logRingDrainCursor)
    {
        logRingDrainCursor = h; // handle wrap / restart
        return;
    }
    LogRingBuffer::Entry tmp[LogRingBuffer::kCapacity];
    int n = logRing.readSince(logRingDrainCursor, tmp, LogRingBuffer::kCapacity);
    for (int i = 0; i < n; i++)
    {
        // Use the timestamp captured at push time, not now, so messages keep
        // their actual ordering. dashLog format prefixes seconds-since-boot.
        logBuf[logHead] = {String(tmp[i].timestamp_ms / 1000) + "s " + String(tmp[i].msg), ++logSeq};
        logHead = (logHead + 1) % LOG_CAP;
        if (logCount < LOG_CAP)
            logCount++;
    }
    logRingDrainCursor = h;
}

// Public hooks
#if !defined(PRODUCT_WIFI_MAX)
static void mcpDashOnFrame(const CanFrame &f)
{
    unsigned long now = millis();
    rxCount++;
    lastFrameMs = now;
    canOnline = true;
    fpsFrames++;
    sniffPush(f);
    if (f.id == 1021 && f.dlc > 0)
    {
        uint8_t m = f.data[0] & 0x07;
        if (m < 4)
            muxRx[m]++;
    }
    if (f.id == 1016 && f.dlc > 5)
        followDist = (f.data[5] & 0xE0) >> 5;
    dashRecordApRestoreFrame(f, now);
    dashRecordCanFrame(f, 'R');
    if (dashWriteProbe.active && dashWriteProbe.state != kDashWriteProbeFailed && dashWriteProbeMatches(f))
    {
        dashWriteProbe.hasRx = true;
        dashWriteProbe.rxMs = now;
        dashWriteProbe.rxDlc = (f.dlc <= 8) ? f.dlc : 8;
        memset(dashWriteProbe.rxData, 0, sizeof(dashWriteProbe.rxData));
        memcpy(dashWriteProbe.rxData, f.data, dashWriteProbe.rxDlc);
        bool same = dashWriteProbe.txDlc == dashWriteProbe.rxDlc &&
                    memcmp(dashWriteProbe.txData, dashWriteProbe.rxData, dashWriteProbe.txDlc) == 0;
        dashWriteProbe.state = same ? kDashWriteProbeMatch : kDashWriteProbeDifferent;
    }
}

static void mcpDashOnTxFrame(const CanFrame &frame, bool ok)
{
    txCount++;
    int8_t mux = dashFrameMux(frame);
    if (!ok)
    {
        txErrCount++;
        if (mux >= 0 && mux < 4)
            muxErr[mux]++;
    }
    else if (mux >= 0 && mux < 4)
    {
        muxTx[mux]++;
    }
    if (ok)
        dashRecordCanFrame(frame, 'T');

    dashWriteProbe.active = true;
    dashWriteProbe.hasRx = false;
    dashWriteProbe.state = ok ? kDashWriteProbePending : kDashWriteProbeFailed;
    dashWriteProbe.id = frame.id;
    dashWriteProbe.mux = mux;
    dashWriteProbe.txMs = millis();
    dashWriteProbe.rxMs = 0;
    dashWriteProbe.txDlc = (frame.dlc <= 8) ? frame.dlc : 8;
    dashWriteProbe.rxDlc = 0;
    memset(dashWriteProbe.txData, 0, sizeof(dashWriteProbe.txData));
    memset(dashWriteProbe.rxData, 0, sizeof(dashWriteProbe.rxData));
    memcpy(dashWriteProbe.txData, frame.data, dashWriteProbe.txDlc);
}
#endif

// JSON escape for log strings
static String jsonEscape(const String &s)
{
    String out;
    out.reserve(s.length() + 8);
    for (unsigned int i = 0; i < s.length(); i++)
    {
        char c = s.charAt(i);
        if (c == '"')
            out += "\\\"";
        else if (c == '\\')
            out += "\\\\";
        else if (c == '\n')
            out += "\\n";
        else if (c == '\r')
            out += "\\r";
        else if (c < 0x20)
            out += ' ';
        else
            out += c;
    }
    return out;
}

static bool dashCheckADEnabled()
{
    return canActive;
}

static bool dashApInjectionAllowed()
{
    // 2.5.2 风格：apInjectionGate=false 时短路放行；=true 时回到 3.0 强制门控。
    return !apInjectionGate || (dashHandler && dashHandler->injectionGateOpen());
}

static bool dashInjectionActive()
{
    return canActive && dashApInjectionAllowed();
}

#if !defined(PRODUCT_WIFI_MAX)
static bool dashApRestoreBraking()
{
    return (apRestoreState.brakeSeen && apRestoreState.brakePedalRaw == 1) ||
           (apRestoreState.chassisSeen && apRestoreState.brakeTorqueActive);
}

static bool dashApRestoreStabilityBlocked()
{
    return apRestoreState.chassisSeen &&
           (apRestoreState.anyVdcActive == 1 || apRestoreState.vdcControlActive > 0 ||
            apRestoreState.tcActive);
}
#endif

static uint32_t dashReadLeBits(const CanFrame &frame, uint8_t startBit, uint8_t length)
{
    uint32_t value = 0;
    for (uint8_t i = 0; i < length; i++)
    {
        uint8_t bit = startBit + i;
        uint8_t byteIndex = bit / 8;
        if (byteIndex >= frame.dlc || byteIndex >= 8)
            break;
        if (frame.data[byteIndex] & (1U << (bit % 8)))
            value |= (1UL << i);
    }
    return value;
}

