hqs17017301634-max/ESP-IDF_waveshare_ESP32_S3_RS485_CAN/include/web/mcp2515_dashboard.h
    const char *wifiModeText = "off";
    switch (wifiMode)
    {
    case WIFI_MODE_STA:
        wifiModeText = "STA";
        break;
    case WIFI_MODE_AP:
        wifiModeText = "AP";
        break;
    case WIFI_MODE_APSTA:
        wifiModeText = "AP+STA";
        break;
    default:
        break;
    }

    wifi_ap_record_t apInfo;
    bool hasRssi = esp_wifi_sta_get_ap_info(&apInfo) == ESP_OK;

    Serial.println();
    Serial.println("[system_status]");
    Serial.printf("uptime=%lus firmware=%s idf=%s\n", (millis() - startMs) / 1000, FIRMWARE_VERSION, IDF_VER);
    Serial.printf("cpu=%luMHz load=", (unsigned long)cpuMhz);
    if (hasCpuLoad)
        Serial.printf("CPU0 %u%% CPU1 %u%%\n", cpu0Load, cpu1Load);
    else
        Serial.println("sampling");
    Serial.printf("heap_free=%u heap_largest=%u heap_min=%u tasks=%u\n",
                  (unsigned)heap_caps_get_free_size(MALLOC_CAP_8BIT),
                  (unsigned)heap_caps_get_largest_free_block(MALLOC_CAP_8BIT),
                  (unsigned)heap_caps_get_minimum_free_size(MALLOC_CAP_8BIT),
                  (unsigned)uxTaskGetNumberOfTasks());
    Serial.printf("wifi=%s connected=%s ap_clients=%u",
                  wifiModeText,
                  WiFi.status() == WL_CONNECTED ? "yes" : "no",
                  (unsigned)WiFi.softAPgetStationNum());
    if (hasRssi)
        Serial.printf(" rssi=%d", apInfo.rssi);
    Serial.println();
    if (hasTemp)
        Serial.printf("temp=%.1fC\n", tempC);
    Serial.println();
}

#if !defined(PRODUCT_WIFI_MAX)
static void dashSerialPrintCanStatus()
{
    unsigned long fpsX10 = static_cast<unsigned long>(fps * 10.0f + 0.5f);
    bool apActive = dashHandler ? (bool)dashHandler->APActive : false;
    bool adEnabled = dashHandler ? (bool)dashHandler->ADEnabled : false;
    int sp = dashHandler ? (int)dashHandler->speedProfile : 0;
    bool spAuto = dashHandler ? (bool)dashHandler->speedProfileAuto : true;
    int gtwAp = dashHandler ? (int)dashHandler->gatewayAutopilot : -1;
    Serial.println();
    Serial.println("[can_status]");
    Serial.printf("can=%s fsd_switch=%s injection_active=%s hw=%u profile=%s/%d\n",
                  canOnline ? "online" : "offline",
                  canActive ? "ON" : "OFF",
                  dashInjectionActive() ? "ON" : "OFF",
                  (unsigned)hwMode,
                  spAuto ? "auto" : "manual",
                  sp);
    Serial.printf("rx=%lu tx=%lu txerr=%lu fps=%lu.%lu follow_dist=%u eflg=0x%02X\n",
                  rxCount, txCount, txErrCount, fpsX10 / 10, fpsX10 % 10,
                  (unsigned)followDist, (unsigned)mcpEflg);
    Serial.printf("APActive=%s ADEnabled=%s GTW_autopilot=%d\n",
                  apActive ? "yes" : "no",
                  adEnabled ? "yes" : "no",
                  gtwAp);    Serial.println();
}
#endif

#if CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS
static TaskStatus_t dashSerialTaskBefore[kMaxTasksForStats];
static UBaseType_t dashSerialTaskBeforeCount = 0;
static uint32_t dashSerialTaskStartMs = 0;
static bool dashSerialTaskSampling = false;

static void dashSerialStartTaskStats()
{
    configRUN_TIME_COUNTER_TYPE totalBefore = 0;
    dashSerialTaskBeforeCount = uxTaskGetSystemState(dashSerialTaskBefore, kMaxTasksForStats, &totalBefore);
    dashSerialTaskStartMs = millis();
    dashSerialTaskSampling = true;
    Serial.println("[task_stats] sampling 1000 ms...");
}

static void dashSerialTaskStatsTick()
{
    if (!dashSerialTaskSampling || millis() - dashSerialTaskStartMs < 1000)
        return;

    TaskStatus_t after[kMaxTasksForStats];
    configRUN_TIME_COUNTER_TYPE totalAfter = 0;
    UBaseType_t afterCount = uxTaskGetSystemState(after, kMaxTasksForStats, &totalAfter);
    uint32_t elapsedMs = millis() - dashSerialTaskStartMs;
    dashSerialTaskSampling = false;
    Serial.print(dashBuildTaskStatsText(dashSerialTaskBefore, dashSerialTaskBeforeCount, after, afterCount, elapsedMs));
}
#else
static void dashSerialStartTaskStats()
{
    Serial.println("FreeRTOS runtime stats are not enabled.");
}

static void dashSerialTaskStatsTick() {}
#endif

static void dashSerialRunCommand(char *cmd)
{
    char *start = cmd;
    while (*start == ' ' || *start == '\t')
        start++;
    char *end = start + strlen(start);
    while (end > start && (end[-1] == ' ' || end[-1] == '\t'))
        *--end = '\0';
    for (char *p = start; *p; p++)
    {
        if (*p >= 'A' && *p <= 'Z')
            *p = *p - 'A' + 'a';
    }

    if (strcmp(start, "help") == 0 || strcmp(start, "?") == 0)
        dashSerialPrintHelp();
    else if (strcmp(start, "system_status") == 0 || strcmp(start, "sys") == 0)
        dashSerialPrintSystemStatus();
#if !defined(PRODUCT_WIFI_MAX)
    else if (strcmp(start, "can_status") == 0 || strcmp(start, "can") == 0)
        dashSerialPrintCanStatus();
#endif
    else if (strcmp(start, "task_stats") == 0 || strcmp(start, "tasks") == 0)
        dashSerialStartTaskStats();
    else if (*start)
        Serial.println("Unknown command. Type help.");
}

static void dashSerialDiagnosticsPoll()
{
    static char cmd[96];
    static uint8_t len = 0;
    static bool announced = false;

    if (!announced && millis() > 3000)
    {
        announced = true;
        Serial.println("[DIAG] Serial commands ready. Type help.");
    }

    dashSerialTaskStatsTick();

    int budget = 24;
    while (budget-- > 0 && Serial.available() > 0)
    {
        int ch = Serial.read();
        if (ch < 0)
            break;
        if (ch == '\r' || ch == '\n')
        {
            if (len > 0)
            {
                cmd[len] = '\0';
                dashSerialRunCommand(cmd);
                len = 0;
            }
            continue;
        }
        if (ch == 8 || ch == 127)
        {
            if (len > 0)
                len--;
            continue;
        }
        if (ch < 32 || ch > 126)
            continue;
        if (len < sizeof(cmd) - 1)
            cmd[len++] = static_cast<char>(ch);
    }
}
#else
static void dashSerialDiagnosticsPoll() {}
#endif

#if !defined(PRODUCT_WIFI_MAX)
static bool dashCanGpioReserved(int pin)
{
#if defined(CONFIG_IDF_TARGET_ESP32S3)
    if (pin >= 26 && pin <= 32)
        return true; // embedded flash/PSRAM bus on ESP32-S3 modules
    if (pin == 45 || pin == 46)
        return true; // strapping/input-only pins
#elif defined(CONFIG_IDF_TARGET_ESP32)
#ifndef DASH_ALLOW_CAN_GPIO_6_11
#define DASH_ALLOW_CAN_GPIO_6_11 0
#endif
#if !DASH_ALLOW_CAN_GPIO_6_11
    if (pin >= 6 && pin <= 11)
        return true; // SPI flash pins on common ESP32 modules
#endif
#endif
    return false;
}

static bool dashCanGpioValid(int pin, bool tx)
{
#if defined(CONFIG_IDF_TARGET_ESP32S3)
    constexpr int kMaxGpio = 48;
#else
    constexpr int kMaxGpio = 39;
#endif
    if (pin < 0 || pin > kMaxGpio || dashCanGpioReserved(pin))
        return false;
#if defined(CONFIG_IDF_TARGET_ESP32)
    if (tx && pin >= 34 && pin <= 39)
        return false; // input-only pins cannot drive TWAI TX
#else
    (void)tx;
#endif
    return true;
}

static void handleCanPins()
{
    Preferences canPrefs;
    bool customized = false;
    int tx = -1, rx = -1;
#if defined(DRIVER_TWAI)
    tx = (int)TWAI_TX_PIN;
    rx = (int)TWAI_RX_PIN;
#endif
    if (canPrefs.begin("can", false))
    {
        int storedTx = canPrefs.getChar("tx", -1);
        int storedRx = canPrefs.getChar("rx", -1);
        canPrefs.end();
        if (dashCanGpioValid(storedTx, true) && dashCanGpioValid(storedRx, false) && storedTx != storedRx)
        {
            tx = storedTx;
            rx = storedRx;
            customized = true;
        }
    }
    String j = "{\"tx\":" + String(tx);
    j += ",\"rx\":" + String(rx);
    j += ",\"customized\":" + String(customized ? "true" : "false");
    j += "}";
    server.send(200, "application/json", j);
}

