hqs17017301634-max/ESP-IDF_waveshare_ESP32_S3_RS485_CAN/include/web/mcp2515_dashboard.h
static void handleCanPinsSave()
{
    int tx = server.arg("tx").toInt();
    int rx = server.arg("rx").toInt();

    if (!dashCanGpioValid(tx, true) || !dashCanGpioValid(rx, false))
    {
        server.send(400, "application/json", "{\"ok\":false,\"error\":\"Invalid or reserved GPIO for CAN\"}");
        return;
    }
    if (tx == rx)
    {
        server.send(400, "application/json", "{\"ok\":false,\"error\":\"TX and RX must differ\"}");
        return;
    }

    Preferences canPrefs;
    if (!canPrefs.begin("can", false))
    {
        server.send(500, "application/json", "{\"ok\":false,\"error\":\"NVS open failed\"}");
        return;
    }
    canPrefs.putChar("tx", (int8_t)tx);
    canPrefs.putChar("rx", (int8_t)rx);
    canPrefs.end();

    dashLog("[CAN] Pins saved: TX=" + String(tx) + " RX=" + String(rx) + " (reboot required)");
    server.send(200, "application/json", "{\"ok\":true,\"reboot\":true}");
}

// ── Settings Backup / Restore ───────────────────────────────────

#endif

static void handleSettingsExport()
{
    Preferences p;
    String apSsid = "", apPass = "", wSsid = "", wPass = "";
    String wIp = "", wGw = "", wMask = "", wDns = "";
    bool wStatic = false, beta = false, autoUpdate = false, apHid = false;
    bool eprn = true;
#if !defined(PRODUCT_WIFI_MAX)
    bool h3Slew = false;
    uint8_t h3SlewRate = kHw3SlewRateDefault;
    uint8_t storedHw = hwMode;
    bool storedCan = canActive;
    bool spAuto = dashSpeedProfileAuto;
    uint8_t spSel = dashManualSpeedProfile;
    bool h3Custom = hw3CustomSpeed;
    bool h3HighSpeed = hw3HighSpeedEnable;
    uint8_t h3Enc = hw3WireEncoding;
    uint8_t h3CustomTargets[kHw3CustomTargetCount];
    uint8_t h3HighSpeedTargets[kHw3HighSpeedBucketCount];
    int canTx = -1, canRx = -1;

    for (uint8_t i = 0; i < kHw3CustomTargetCount; i++)
        h3CustomTargets[i] = hw3CustomTarget[i];
    for (uint8_t i = 0; i < kHw3HighSpeedBucketCount; i++)
        h3HighSpeedTargets[i] = hw3HighSpeedTarget[i];
#endif

    if (p.begin(PREFS_NS, false))
    {
#if !defined(PRODUCT_WIFI_MAX)
        storedHw = p.getUChar("hw", hwMode);
        storedCan = p.getBool("can", canActive);
        spAuto = p.getBool("sp_auto", dashSpeedProfileAuto);
        spSel = p.getUChar("sp_sel", dashManualSpeedProfile);
#endif
        eprn = p.getBool("eprn", true);
        if (p.isKey("ap_ssid"))
            apSsid = p.getString("ap_ssid", "");
        if (p.isKey("ap_pass"))
            apPass = p.getString("ap_pass", "");
        apHid = p.getBool("ap_hidden", false);
        if (p.isKey("wifi_ssid"))
            wSsid = p.getString("wifi_ssid", "");
        if (p.isKey("wifi_pass"))
            wPass = p.getString("wifi_pass", "");
        wStatic = p.getBool("wifi_static", false);
        if (p.isKey("wifi_ip"))
            wIp = p.getString("wifi_ip", "");
        if (p.isKey("wifi_gw"))
            wGw = p.getString("wifi_gw", "");
        if (p.isKey("wifi_mask"))
            wMask = p.getString("wifi_mask", "");
        if (p.isKey("wifi_dns"))
            wDns = p.getString("wifi_dns", "");
        beta = p.getBool("update_beta", p.getBool("upd_beta", false));
        autoUpdate = p.getBool("auto_upd", false);
#if !defined(PRODUCT_WIFI_MAX)
        h3Slew = p.getBool("h3_slw", false);
        h3SlewRate = dashLoadHw3SlewRate(p.getUChar("h3_srt", kHw3SlewRateDefault));
        h3Custom = p.getBool("h3_cust", hw3CustomSpeed);
        h3HighSpeed = p.getBool("h3_hse", hw3HighSpeedEnable);
        h3Enc = p.getUChar("h3_enc", hw3WireEncoding);
        char k[8];
        for (uint8_t i = 0; i < kHw3CustomTargetCount; i++)
        {
            snprintf(k, sizeof(k), "h3_ct%u", (unsigned)i);
            h3CustomTargets[i] = p.getUChar(k, h3CustomTargets[i]);
        }
        for (uint8_t i = 0; i < kHw3HighSpeedBucketCount; i++)
        {
            snprintf(k, sizeof(k), "h3_ht%u", (unsigned)i);
            h3HighSpeedTargets[i] = p.getUChar(k, h3HighSpeedTargets[i]);
        }
#endif
        p.end();
    }
#if !defined(PRODUCT_WIFI_MAX)
    Preferences cp;
    if (cp.begin("can", true))
    {
        canTx = cp.getChar("tx", -1);
        canRx = cp.getChar("rx", -1);
        cp.end();
    }
#endif

    String j = "{\"version\":\"" FIRMWARE_VERSION "\"";
#if defined(PRODUCT_WIFI_MAX)
    j += ",\"product\":\"wifi-max\"";
    j += ",\"device\":{\"dashboardLog\":" + String(eprn ? "true" : "false") + "}";
#else
    j += ",\"device\":{\"hw\":" + String(storedHw) + ",\"can\":" + String(storedCan ? "true" : "false");
    j += ",\"speedProfileAuto\":" + String(spAuto ? "true" : "false") + ",\"speedProfile\":" + String(spSel);
    j += ",\"dashboardLog\":" + String(eprn ? "true" : "false") + "}";
#endif
    j += ",\"ap\":{\"ssid\":\"" + jsonEscape(apSsid) + "\",\"pass\":\"" + jsonEscape(apPass) + "\",\"hidden\":" + String(apHid ? "true" : "false") + "}";
    j += ",\"wifi\":{\"ssid\":\"" + jsonEscape(wSsid) + "\",\"pass\":\"" + jsonEscape(wPass) + "\"";
    j += ",\"static\":" + String(wStatic ? "true" : "false");
    j += ",\"ip\":\"" + jsonEscape(wIp) + "\",\"gw\":\"" + jsonEscape(wGw) + "\"";
    j += ",\"mask\":\"" + jsonEscape(wMask) + "\",\"dns\":\"" + jsonEscape(wDns) + "\"}";
    j += ",\"wifiNetworks\":[";
    for (uint8_t i = 0; i < wifiNetworkCount; i++)
    {
        if (i)
            j += ",";
        const DashWifiNetwork &n = wifiNetworks[i];
        j += "{\"ssid\":\"" + jsonEscape(n.ssid) + "\",\"pass\":\"" + jsonEscape(n.pass) + "\"";
        j += ",\"static\":" + String(n.useStatic ? "true" : "false");
        j += ",\"ip\":\"" + jsonEscape(n.ip) + "\",\"gw\":\"" + jsonEscape(n.gw) + "\"";
        j += ",\"mask\":\"" + jsonEscape(n.mask) + "\",\"dns\":\"" + jsonEscape(n.dns) + "\"}";
    }
    j += "]";
    j += ",\"wifiPreferred\":" + String(wifiActiveSlot >= 0 ? wifiActiveSlot : 0);
#if !defined(PRODUCT_WIFI_MAX)
    j += ",\"hw3\":{\"offsetSlew\":" + String(h3Slew ? "true" : "false") + ",\"slewRate\":" + String(h3SlewRate);
    j += ",\"custom\":" + String(h3Custom ? "true" : "false");
    j += ",\"highSpeed\":" + String(h3HighSpeed ? "true" : "false") + ",\"encoding\":" + String(h3Enc);
    j += ",\"customTargets\":[";
    for (uint8_t i = 0; i < kHw3CustomTargetCount; i++)
    {
        if (i)
            j += ",";
        j += String(h3CustomTargets[i]);
    }
    j += "],\"highSpeedTargets\":[";
    for (uint8_t i = 0; i < kHw3HighSpeedBucketCount; i++)
    {
        if (i)
            j += ",";
        j += String(h3HighSpeedTargets[i]);
    }
    j += "]}";
    j += ",\"can\":{\"tx\":" + String(canTx) + ",\"rx\":" + String(canRx) + "}";
#endif
    j += ",\"updates\":{\"beta\":" + String(beta ? "true" : "false") + ",\"auto\":" + String(autoUpdate ? "true" : "false") + "}";
    j += ",\"beta\":" + String(beta ? "true" : "false");
#if defined(ESP_PLATFORM) && defined(DASH_STA_AP_GATEWAY)
    j += ",\"gateway\":{\"enabled\":" + String(gatewayEnabled ? "true" : "false");
    j += ",\"blacklist\":\"" + jsonEscape(gatewayDnsBlacklist.c_str()) + "\"";
    j += ",\"whitelist\":\"" + jsonEscape(gatewayDnsWhitelist.c_str()) + "\"}";
#endif
    j += "}";

