hqs17017301634-max/ESP-IDF_waveshare_ESP32_S3_RS485_CAN/include/web/mcp2515_dashboard.h
    server.sendHeader("Content-Disposition", "attachment; filename=\"evtools-backup.json\"");
    server.send(200, "application/json", j);
}

static void handleSettingsImport()
{
    String body = server.arg("plain");
    if (body.length() == 0)
    {
        server.send(400, "application/json", "{\"ok\":false,\"error\":\"Empty body\"}");
        return;
    }

    JsonDocument doc;
    DeserializationError err = deserializeJson(doc, body);
    if (err)
    {
        server.send(400, "application/json", "{\"ok\":false,\"error\":\"Invalid JSON\"}");
        return;
    }

    Preferences p;
    if (!p.begin(PREFS_NS, false))
    {
        server.send(500, "application/json", "{\"ok\":false,\"error\":\"NVS open failed\"}");
        return;
    }

    if (doc["device"].is<JsonObject>())
    {
#if !defined(PRODUCT_WIFI_MAX)
        if (doc["device"]["hw"].is<int>())
        {
            int hw = doc["device"]["hw"].as<int>();
            if (hw >= 0 && hw <= 2)
                p.putUChar("hw", static_cast<uint8_t>(hw));
        }
        if (doc["device"]["can"].is<bool>())
        {
            bool fsdSwitch = doc["device"]["can"].as<bool>();
            p.putBool("can", fsdSwitch);
            p.putBool("force_act", fsdSwitch);
        }
        if (doc["device"]["speedProfileAuto"].is<bool>())
            p.putBool("sp_auto", doc["device"]["speedProfileAuto"].as<bool>());
        if (doc["device"]["speedProfile"].is<int>())
        {
            uint8_t targetHw = p.getUChar("hw", hwMode);
            p.putUChar("sp_sel", dashClampSpeedProfileForHw(targetHw, doc["device"]["speedProfile"].as<int>()));
        }
#endif
        if (doc["device"]["dashboardLog"].is<bool>())
            p.putBool("eprn", doc["device"]["dashboardLog"].as<bool>());
    }
    if (doc["ap"].is<JsonObject>())
    {
        const char *s = doc["ap"]["ssid"] | "";
        const char *pw = doc["ap"]["pass"] | "";
        size_t ssidLen = strlen(s);
        size_t passLen = strlen(pw);
        if (ssidLen > 0 && ssidLen <= kDashMaxSsidLen)
            p.putString("ap_ssid", s);
        if (dashApPasswordLengthValid(passLen))
            p.putString("ap_pass", pw);
        if (doc["ap"]["hidden"].is<bool>())
            p.putBool("ap_hidden", doc["ap"]["hidden"].as<bool>());
    }
    if (doc["wifi"].is<JsonObject>())
    {
        const char *s = doc["wifi"]["ssid"] | "";
        const char *pw = doc["wifi"]["pass"] | "";
        if (strlen(s) <= kDashMaxSsidLen && strlen(pw) <= kDashMaxPassLen)
        {
            p.putString("wifi_ssid", s);
            p.putString("wifi_pass", pw);
        }
        p.putBool("wifi_static", doc["wifi"]["static"] | false);
        p.putString("wifi_ip", (const char *)(doc["wifi"]["ip"] | ""));
        p.putString("wifi_gw", (const char *)(doc["wifi"]["gw"] | ""));
        p.putString("wifi_mask", (const char *)(doc["wifi"]["mask"] | ""));
        p.putString("wifi_dns", (const char *)(doc["wifi"]["dns"] | ""));
    }
    if (doc["wifiNetworks"].is<JsonArray>())
    {
        JsonArray nets = doc["wifiNetworks"].as<JsonArray>();
        uint8_t count = 0;
        for (uint8_t i = 0; i < kDashMaxWifiNetworks; i++)
            dashRemoveWifiSlotKeys(i);
        for (JsonVariant v : nets)
        {
            if (count >= kDashMaxWifiNetworks || !v.is<JsonObject>())
                break;
            const char *s = v["ssid"] | "";
            const char *pw = v["pass"] | "";
            if (strlen(s) == 0 || !dashStaConfigLengthValid(String(s), String(pw)) || dashStaSsidLooksCorrupt(String(s)))
                continue;
            p.putString(dashWifiKey(count, "s").c_str(), s);
            p.putString(dashWifiKey(count, "p").c_str(), pw);
            bool st = v["static"] | false;
            p.putBool(dashWifiKey(count, "t").c_str(), st);
            if (st)
            {
                p.putString(dashWifiKey(count, "i").c_str(), (const char *)(v["ip"] | "0.0.0.0"));
                p.putString(dashWifiKey(count, "g").c_str(), (const char *)(v["gw"] | "0.0.0.0"));
                p.putString(dashWifiKey(count, "m").c_str(), (const char *)(v["mask"] | "255.255.255.0"));
                p.putString(dashWifiKey(count, "d").c_str(), (const char *)(v["dns"] | "0.0.0.0"));
            }
            count++;
        }
        p.putUChar("wn_cnt", count);
        uint8_t pref = doc["wifiPreferred"] | 0;
        p.putUChar("wn_pref", count > 0 && pref < count ? pref : 0);
    }
    if (doc["updates"].is<JsonObject>())
    {
        if (doc["updates"]["beta"].is<bool>())
        {
            p.putBool("update_beta", doc["updates"]["beta"].as<bool>());
            p.putBool("upd_beta", doc["updates"]["beta"].as<bool>());
        }
        if (doc["updates"]["auto"].is<bool>())
            p.putBool("auto_upd", doc["updates"]["auto"].as<bool>());
    }
    else if (doc["beta"].is<bool>())
    {
        p.putBool("update_beta", doc["beta"].as<bool>());
        p.putBool("upd_beta", doc["beta"].as<bool>());
    }
#if !defined(PRODUCT_WIFI_MAX)
    if (doc["hw3"].is<JsonObject>())
    {
        if (doc["hw3"]["offsetSlew"].is<bool>())
            p.putBool("h3_slw", doc["hw3"]["offsetSlew"].as<bool>());
        if (doc["hw3"]["slewRate"].is<int>())
            p.putUChar("h3_srt", dashClampHw3SlewRate(doc["hw3"]["slewRate"].as<int>()));
        if (doc["hw3"]["custom"].is<bool>())
            p.putBool("h3_cust", doc["hw3"]["custom"].as<bool>());
        if (doc["hw3"]["highSpeed"].is<bool>())
            p.putBool("h3_hse", doc["hw3"]["highSpeed"].as<bool>());
        if (doc["hw3"]["encoding"].is<int>())
        {
            uint8_t enc = doc["hw3"]["encoding"].as<int>() == kHw3WireEncKph5 ? kHw3WireEncKph5 : kHw3WireEncPct4;
            p.putUChar("h3_enc", enc);
        }
        if (doc["hw3"]["customTargets"].is<JsonArray>())
        {
            JsonArray arr = doc["hw3"]["customTargets"].as<JsonArray>();
            char k[8];
            for (uint8_t i = 0; i < kHw3HighSpeedBucketCount && i < arr.size(); i++)
            {
                snprintf(k, sizeof(k), "h3_ct%u", (unsigned)i);
                p.putUChar(k, dashClampHw3CustomTargetForBucket(i, arr[i].as<int>()));
            }
        }
        if (doc["hw3"]["highSpeedTargets"].is<JsonArray>())
        {
            JsonArray arr = doc["hw3"]["highSpeedTargets"].as<JsonArray>();
            char k[8];
            for (uint8_t i = 0; i < 5 && i < arr.size(); i++)
            {
                snprintf(k, sizeof(k), "h3_ht%u", (unsigned)i);
                p.putUChar(k, dashClampHw3HighSpeedTargetForBucket(i, arr[i].as<int>()));
            }
        }
    }
#endif
    p.end();

#if !defined(PRODUCT_WIFI_MAX)
    if (doc["can"].is<JsonObject>())
    {
        int tx = doc["can"]["tx"] | -1;
        int rx = doc["can"]["rx"] | -1;
        Preferences cp;
        if (cp.begin("can", false))
        {
            if (tx >= 0 && tx <= 39 && rx >= 0 && rx <= 39 && tx != rx &&
                !((tx >= 6 && tx <= 11) || (rx >= 6 && rx <= 11)))
            {
                cp.putChar("tx", (int8_t)tx);
                cp.putChar("rx", (int8_t)rx);
            }
            cp.end();
        }
    }
#endif

#if defined(ESP_PLATFORM) && defined(DASH_STA_AP_GATEWAY)
    if (doc["gateway"].is<JsonObject>())
    {
        JsonObject gw = doc["gateway"].as<JsonObject>();
        if (gw["enabled"].is<bool>())
            gatewayEnabled = gw["enabled"].as<bool>();
        if (gw["blacklist"].is<const char *>())
            gatewayDnsBlacklist = dashGatewaySanitizeBlacklist((const char *)(gw["blacklist"] | ""));
        if (gw["whitelist"].is<const char *>())
            gatewayDnsWhitelist = dashGatewaySanitizeWhitelist((const char *)(gw["whitelist"] | ""));
        dashGatewaySave();
    }
#endif

    dashLog("[BACKUP] Settings imported (reboot required)");
    server.send(200, "application/json", "{\"ok\":true,\"reboot\":true}");
}

static void handleApConfig()
{
    String newSsid = server.arg("ssid");
    String newPass = server.arg("pass");
    bool hasHidden = server.hasArg("hidden");
    bool newHidden = hasHidden && (server.arg("hidden") == "1" || server.arg("hidden") == "true");

    if (newSsid.length() == 0)
    {
        server.send(400, "application/json", "{\"ok\":false,\"error\":\"SSID required\"}");
        return;
    }
    if (newSsid.length() > kDashMaxSsidLen)
    {
        server.send(400, "application/json", "{\"ok\":false,\"error\":\"SSID must be 32 bytes or less\"}");
        return;
    }
    if (newPass.length() > 0 && !dashApPasswordLengthValid(newPass.length()))
    {
        server.send(400, "application/json", "{\"ok\":false,\"error\":\"Password must be 8-64 characters\"}");
        return;
    }

